Revit 2027 API
BuiltInFailures.StairRampFailures.CannotComputeRailElevation Property
 Can't compute elevation profile for one or more Rails
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotComputeRailElevation { get; }
Public Shared ReadOnly Property CannotComputeRailElevation As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotComputeRailElevation {
	FailureDefinitionId^ get ();
}
static member CannotComputeRailElevation : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace